Revit 2027 API
RebarShapeMultiplanarDefinition.IsEndConnectorPresent Property
 Whether a perpendicular segment is constructed from the end of the 2D shape.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEndConnectorPresent { get; }
Public ReadOnly Property IsEndConnectorPresent As Boolean
	Get
public:
property bool IsEndConnectorPresent {
	bool get ();
}
member IsEndConnectorPresent : bool with get
Property Value
Boolean
See Also
Reference
RebarShapeMultiplanarDefinition Class
Autodesk.Revit.DB.Structure Namespace